[
  {
    "timestamp": "2025-07-23T11:18:15.299602",
    "data": {
      "analysis_id": "6544b78e-701a-4c82-82c8-f88e40f4558f",
      "name": "",
      "age": "",
      "results": [
        {
          "image_path": "static/uploads/6544b78e-701a-4c82-82c8-f88e40f4558f_banana_tree_image.jpg",
          "banana_detected": false,
          "flower_detected": false,
          "stage": "Vegetative Stage",
          "advice": "Okay, let s get your banana plant thriving. Since it s in the vegetative stage with no fruits or flowers, it needs focus on growth. First, ensure it s getting plenty of sunlight. Bananas love sun, ideally 6-8 hours a day. Next, check the soil. It should be well-draining but consistently moist. Water deeply when the top inch of soil feels dry. Avoid overwatering, which can cause root rot. Fertilize regularly with a balanced fertilizer, following the package instructions. A fertilizer higher in nitrogen will promote leaf growth during this stage. Keep an eye out for pests like aphids or spider mites. If you see any, treat them with insecticidal soap or neem oil. Finally, make sure the plant has enough space to grow. If it s in a pot, consider repotting it into a larger container as it grows. Good luck.",
          "translated_advice": "Okay, let s get your banana plant thriving. Since it s in the vegetative stage with no fruits or flowers, it needs focus on growth. First, ensure it s getting plenty of sunlight. Bananas love sun, ideally 6-8 hours a day. Next, check the soil. It should be well-draining but consistently moist. Water deeply when the top inch of soil feels dry. Avoid overwatering, which can cause root rot. Fertilize regularly with a balanced fertilizer, following the package instructions. A fertilizer higher in nitrogen will promote leaf growth during this stage. Keep an eye out for pests like aphids or spider mites. If you see any, treat them with insecticidal soap or neem oil. Finally, make sure the plant has enough space to grow. If it s in a pot, consider repotting it into a larger container as it grows. Good luck.",
          "filename": "banana_tree_image.jpg"
        }
      ],
      "questions": []
    }
  },
  {
    "timestamp": "2025-07-23T11:18:56.185639",
    "data": {
      "analysis_id": "6b24ad99-3ef9-4f02-8f08-58ad51e7d6cf",
      "name": "",
      "age": "",
      "results": [
        {
          "image_path": "static/uploads/6b24ad99-3ef9-4f02-8f08-58ad51e7d6cf_banana_tree_image.jpg",
          "banana_detected": false,
          "flower_detected": false,
          "stage": "Vegetative Stage",
          "advice": "Okay, let s get your banana plant thriving. Since it s in the vegetative stage with no fruits or flowers, we need to focus on growth and preparation for fruiting. First, ensure it s getting plenty of sunlight. Bananas need at least 6-8 hours of direct sunlight daily. If it s indoors, consider a grow light. Next, check the soil. It should be well-draining but consistently moist. Water deeply when the top inch of soil feels dry. Avoid overwatering, which can lead to root rot. Fertilize regularly with a balanced fertilizer, following the package instructions. A fertilizer higher in nitrogen will promote leaf growth during this vegetative stage. Inspect the plant for pests like aphids or spider mites. If you find any, treat them with insecticidal soap or neem oil. Finally, make sure the plant has enough space to grow. If it s in a pot, consider repotting it into a larger container as it grows. This will give the roots more room to develop. Good luck with your banana plant.",
          "translated_advice": "ठीक आहे, आपल्या केळीची वनस्पती भरभराट होऊ द्या.हे फळ किंवा फुले नसलेल्या वनस्पतिवत् होणारी अवस्थेत असल्याने, आपल्याला फळांच्या वाढीवर आणि तयारीवर लक्ष केंद्रित करण्याची आवश्यकता आहे.प्रथम, हे सुनिश्चित करा की हे भरपूर सूर्यप्रकाश मिळत आहे.केळीला दररोज किमान 6-8 तास थेट सूर्यप्रकाशाची आवश्यकता असते.जर ते घरामध्ये असेल तर वाढवा प्रकाशाचा विचार करा.पुढे, माती तपासा.हे चांगले निचरा करणे परंतु सातत्याने ओलसर असले पाहिजे.जेव्हा मातीचा वरचा इंच कोरडा वाटतो तेव्हा पाणी खोलवर.ओव्हरवॉटरिंग टाळा, ज्यामुळे रूट रॉट होऊ शकते.पॅकेजच्या सूचनांचे अनुसरण करून संतुलित खतासह नियमितपणे सुपिकता करा.नायट्रोजनमध्ये जास्त खत या वनस्पतिवत् होणारी अवस्था दरम्यान पानांच्या वाढीस प्रोत्साहन देईल.Ph फिडस् किंवा स्पायडर माइट्स सारख्या कीटकांसाठी वनस्पतीची तपासणी करा.आपल्याला काही सापडल्यास, कीटकनाशक साबण किंवा कडुनिंब तेलाने त्यांच्याशी उपचार करा.शेवटी, हे सुनिश्चित करा की वनस्पती वाढण्यासाठी पुरेशी जागा आहे.जर ते एका भांड्यात असेल तर ते वाढत असताना मोठ्या कंटेनरमध्ये पुनर्स्थित करण्याचा विचार करा.हे मुळांना विकसित करण्यासाठी अधिक खोली देईल.आपल्या केळीच्या वनस्पतीसाठी शुभेच्छा.",
          "filename": "banana_tree_image.jpg"
        }
      ],
      "questions": []
    }
  }
]